robinhedwards/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
	return 0;
}

int isProbablyCV(int size, unsigned char *bytes)
{ 	// CV RAM access occurs at addresses $f3ff and $f400
	// These signatures are attributed to the MESS project
	unsigned char signature[2][3] = {
		    { 0x9D, 0xFF, 0xF3 },  // STA $F3FF.X
		    { 0x99, 0x00, 0xF4 }   // STA $F400.Y
		};
	for (int i = 0; i < 2; ++i)
		if(searchForBytes(bytes, size, signature[i], 3, 1))
			return 1;
	return 0;
}

int isProbablyEF(int size, unsigned char *bytes)
{ 	// EF cart bankswitching switches banks by accessing addresses
	// 0xFE0 to 0xFEF, usually with either a NOP or LDA
	// It's likely that the code will switch to bank 0, so that's what is tested
	unsigned char signature[4][3] = {
		    { 0x0C, 0xE0, 0xFF },  // NOP $FFE0
		    { 0xAD, 0xE0, 0xFF },  // LDA $FFE0
		    { 0x0C, 0xE0, 0x1F },  // NOP $1FE0
		    { 0xAD, 0xE0, 0x1F }   // LDA $1FE0
		};
	for (int i = 0; i < 4; ++i)
		if(searchForBytes(bytes, size, signature[i], 3, 1))
			return 1;
	return 0;
}

int isProbablyE7(int size, unsigned char *bytes)
{ 	// These signatures are attributed to the MESS project
	unsigned char signature[7][3] = {
		    { 0xAD, 0xE2, 0xFF },  // LDA $FFE2
		    { 0xAD, 0xE5, 0xFF },  // LDA $FFE5
		    { 0xAD, 0xE5, 0x1F },  // LDA $1FE5
		    { 0xAD, 0xE7, 0x1F },  // LDA $1FE7
		    { 0x0C, 0xE7, 0x1F },  // NOP $1FE7
		    { 0x8D, 0xE7, 0xFF },  // STA $FFE7
		    { 0x8D, 0xE7, 0x1F }   // STA $1FE7
		};
	for (int i = 0; i < 7; ++i)
		if(searchForBytes(bytes, size, signature[i], 3, 1))
			return 1;
	return 0;
}

/*************************************************************************
 * File/Directory Handling
 *************************************************************************/

#define NUM_DIR_ITEMS	80

typedef struct {
	char isDir;
	char filename[13];
	char long_filename[32];
} DIR_ENTRY;

DIR_ENTRY dir_entries[NUM_DIR_ITEMS];

int num_dir_entries = 0; // how many entries in the current directory

int entry_compare(const void* p1, const void* p2)
{
	DIR_ENTRY* e1 = (DIR_ENTRY*)p1;
	DIR_ENTRY* e2 = (DIR_ENTRY*)p2;
	if (e1->isDir && !e2->isDir) return -1;
	else if (!e1->isDir && e2->isDir) return 1;
	else return stricmp(e1->long_filename, e2->long_filename);
}

char *get_filename_ext(char *filename) {
    char *dot = strrchr(filename, '.');
    if(!dot || dot == filename) return "";
    return dot + 1;
}

int is_valid_file(char *filename) {
	char *ext = get_filename_ext(filename);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (stricmp(ext, p->ext) == 0)
			return 1;
		p++;
	}
	return 0;
}

// single FILINFO structure
FILINFO fno;
char lfn[_MAX_LFN + 1];   /* Buffer to store the LFN */

void init() {
	// this seems to be required for this version of FAT FS
	fno.lfname = lfn;
	fno.lfsize = sizeof lfn;
}

int read_directory(char *path) {
	int ret = 0;
	num_dir_entries = 0;
	DIR_ENTRY *dst = (DIR_ENTRY *)&dir_entries[0];

	FATFS FatFs;
	TM_DELAY_Init();
	if (f_mount(&FatFs, "", 1) == FR_OK) {
		DIR dir;
		if (f_opendir(&dir, path) == FR_OK) {
			if (strlen(path))
			{	// not root directory, add pseudo ".." to go up a dir
				dst->isDir = 1;
				strcpy(dst->long_filename, "(GO BACK)");
				strcpy(dst->filename, "..");
				num_dir_entries++;
				dst++;
			}
			while (num_dir_entries < NUM_DIR_ITEMS) {
				if (f_readdir(&dir, &fno) != FR_OK || fno.fname[0] == 0)
					break;
				if (fno.fattrib & (AM_HID | AM_SYS))
					continue;
				dst->isDir = fno.fattrib & AM_DIR ? 1 : 0;
				if (!dst->isDir)
					if (!is_valid_file(fno.fname)) continue;
				// copy file record
	            strcpy(dst->filename, fno.fname);
				if (fno.lfname[0]) {
					strncpy(dst->long_filename, fno.lfname, 31);
					dst->long_filename[31] = 0;
				}
				else strcpy(dst->long_filename, fno.fname);
	            dst++;
				num_dir_entries++;
			}
			f_closedir(&dir);
			qsort((DIR_ENTRY *)&dir_entries[0], num_dir_entries, sizeof(DIR_ENTRY), entry_compare);
			ret = 1;
		}
		f_mount(0, "", 1);
	}
	return ret;
}

int read_file(char *filename, int *cart_size_bytes)
{
	TM_DELAY_Init();
	FATFS FatFs;
	UINT bytes_read;
	int cart_type = CART_TYPE_NONE;

	if (f_mount(&FatFs, "", 1) != FR_OK)
		return CART_TYPE_NONE;
	FIL fil;
	if (f_open(&fil, filename, FA_READ) != FR_OK)
		goto cleanup;
	if (f_read(&fil, &cart_rom[0], MAX_CART_ROM_SIZE*1024, &bytes_read) != FR_OK)
		goto closefile;

	// auto-detect cart type - largely follows code in Stella's CartDetector.cpp
	if (bytes_read == 2*1024)
	{
		if (isProbablyCV(bytes_read, cart_rom))
			cart_type = CART_TYPE_CV;
		else
			cart_type = CART_TYPE_2K;
	}
	else if (bytes_read == 4*1024)
	{
		cart_type = CART_TYPE_4K;
	}
	else if (bytes_read == 8*1024)
	{
		// First check for *potential* F8
		unsigned char  signature[] = { 0x8D, 0xF9, 0x1F };  // STA $1FF9
		int f8 = searchForBytes(cart_rom, bytes_read, signature, 3, 2);

		if (isProbablySC(bytes_read, cart_rom))
			cart_type = CART_TYPE_F8SC;
		else if (memcmp(cart_rom, cart_rom + 4096, 4096) == 0)
			cart_type = CART_TYPE_4K;
		else if (isProbablyE0(bytes_read, cart_rom))
			cart_type = CART_TYPE_E0;
		else if (isProbably3E(bytes_read, cart_rom))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, cart_rom))
			cart_type = CART_TYPE_3F;
		else if (isProbablyFE(bytes_read, cart_rom) && !f8)
			cart_type = CART_TYPE_FE;
		else if (isProbably0840(bytes_read, cart_rom))
			cart_type = CART_TYPE_0840;
		else
			cart_type = CART_TYPE_F8;
	}
	else if(bytes_read >= 10240 && bytes_read <= 10496)
	{  // ~10K - Pitfall II
		cart_type = CART_TYPE_DPC;
	}
	else if (bytes_read == 12*1024)
	{
		cart_type = CART_TYPE_FA;
	}
	else if (bytes_read == 16*1024)
	{
		if (isProbablySC(bytes_read, cart_rom))
			cart_type = CART_TYPE_F6SC;
		else if (isProbablyE7(bytes_read, cart_rom))
			cart_type = CART_TYPE_E7;
		else if (isProbably3E(bytes_read, cart_rom))
			cart_type = CART_TYPE_3E;
		else
			cart_type = CART_TYPE_F6;
	}
	else if (bytes_read == 32*1024)
	{
		if (isProbablySC(bytes_read, cart_rom))
			cart_type = CART_TYPE_F4SC;
		else if (isProbably3E(bytes_read, cart_rom))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, cart_rom))
			cart_type = CART_TYPE_3F;
		else
			cart_type = CART_TYPE_F4;
	}
	else if (bytes_read == 64*1024)
	{
		if (isProbably3E(bytes_read, cart_rom))
			cart_type = CART_TYPE_3E;
		else if (isProbably3F(bytes_read, cart_rom))
			cart_type = CART_TYPE_3F;
		else if (isProbablyEF(bytes_read, cart_rom))
		{
			if (isProbablySC(bytes_read, cart_rom))
				cart_type = CART_TYPE_EFSC;
			else
				cart_type = CART_TYPE_EF;
		}
		else
			cart_type = CART_TYPE_F0;
	}

	// override type by file extension?
	char *ext = get_filename_ext(filename);
	EXT_TO_CART_TYPE_MAP *p = ext_to_cart_type_map;
	while (p->ext) {
		if (stricmp(ext, p->ext) == 0) {
			if (p->cart_type) cart_type = p->cart_type;
			break;
		}
		p++;
	}
	*cart_size_bytes = bytes_read;

closefile:
	f_close(&fil);
cleanup:
	f_mount(0, "", 1);
	return cart_type;
}

/*************************************************************************
 * MCU Initialisation
 *************************************************************************/

GPIO_InitTypeDef  GPIO_InitStructure;

