robinhedwards/UnoCart-2600/source/STM32firmware/Atari2600Cart/src/main.c
					case 0x01:
					{	// DFx bottom count
						DpcBottoms[index] = value;
						break;
					}

					case 0x02:
					{	// DFx counter low
						DpcCounters[index] = (DpcCounters[index] & 0x0700) | value;
						break;
					}

					case 0x03:
					{	// DFx counter high
						DpcCounters[index] = (((uint16_t)(value & 0x07)) << 8) | (DpcCounters[index] & 0xff);
						if(index >= 5)
							DpcMusicModes[index - 5] = (value & 0x10);
						break;
					}

					case 0x06:
					{	// Random Number Generator Reset
						DpcRandom = 1;
						break;
					}
				}
			}
			else
			{	// check bank-switch
				if (addr == 0x1FF8)
					bankPtr = &cart_rom[0];
				else if (addr == 0x1FF9)
					bankPtr = &cart_rom[4*1024];

				// normal rom access
				DATA_OUT = ((uint16_t)bankPtr[addr&0xFFF])<<8;
				SET_DATA_MODE_OUT
				// wait for address bus to change
				while (ADDR_IN == addr) ;
				SET_DATA_MODE_IN
			}
		}
		else
		{	// non cartridge access - e.g. sta wsync
			while (ADDR_IN == addr) {
				// should the DPC clock be incremented?
				uint32_t sysTick = SysTick->VAL;
				if (sysTick > lastSysTick)
				{	// the 21KHz clock has wrapped, so we increase the DPC clock
					DpcClocks++;
					// update the music flags here, since there isn't enough time when the music register
					// is being read.
					DpcMusicFlags[0] = (DpcClocks % (DpcTops[5]+1)) > DpcBottoms[5];
					DpcMusicFlags[1] = (DpcClocks % (DpcTops[6]+1)) > DpcBottoms[6];
					DpcMusicFlags[2] = (DpcClocks % (DpcTops[7]+1)) > DpcBottoms[7];
				}
				lastSysTick = sysTick;
			}
		}
	}
	__enable_irq();
}

/*************************************************************************
 * Main loop/helper functions
 *************************************************************************/

void emulate_cartridge(int cart_type, int cart_size_bytes)
{
	if (cart_type == CART_TYPE_2K)
		emulate_2k_cartridge();
	else if (cart_type == CART_TYPE_4K)
		emulate_4k_cartridge();
	else if (cart_type == CART_TYPE_F8)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F6)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 0);
	else if (cart_type == CART_TYPE_F4)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 0);
	else if (cart_type == CART_TYPE_F8SC)
		emulate_FxSC_cartridge(0x1FF8, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F6SC)
		emulate_FxSC_cartridge(0x1FF6, 0x1FF9, 1);
	else if (cart_type == CART_TYPE_F4SC)
		emulate_FxSC_cartridge(0x1FF4, 0x1FFB, 1);
	else if (cart_type == CART_TYPE_FE)
		emulate_FE_cartridge();
	else if (cart_type == CART_TYPE_3F)
		emulate_3F_cartridge(cart_size_bytes);
	else if (cart_type == CART_TYPE_3E)
		emulate_3E_cartridge(cart_size_bytes);
	else if (cart_type == CART_TYPE_E0)
		emulate_E0_cartridge();
	else if (cart_type == CART_TYPE_0840)
		emulate_0840_cartridge();
	else if (cart_type == CART_TYPE_CV)
		emulate_CV_cartridge();
	else if (cart_type == CART_TYPE_EF)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 0);
	else if (cart_type == CART_TYPE_EFSC)
		emulate_FxSC_cartridge(0x1FE0, 0x1FEF, 1);
	else if (cart_type == CART_TYPE_F0)
		emulate_F0_cartridge();
	else if (cart_type == CART_TYPE_FA)
		emulate_FA_cartridge();
	else if (cart_type == CART_TYPE_E7)
		emulate_E7_cartridge();
	else if (cart_type == CART_TYPE_DPC)
		emulate_DPC_cartridge();
}

void convertFilenameForCart(unsigned char *dst, char *src)
{
	memset(dst, ' ', 12);
	for (int i=0; i<12; i++) {
		if (!src[i]) break;
		char c = toupper(src[i]);
		dst[i] = c;
	}
}

int readDirectoryForAtari(char *path)
{
	int ret = read_directory(path);
	// create a table of entries for the atari to read
	memset(menu_ram, 0, 1024);
	for (int i=0; i<num_dir_entries; i++)
	{
		unsigned char *dst = &menu_ram[i*12];
		convertFilenameForCart(dst, dir_entries[i].long_filename);
		// set the high-bit of the first character if directory
		if (dir_entries[i].isDir) *dst += 0x80;
	}
	return ret;
}
int main(void)
{
	char curPath[256] = "";
	int cart_type = CART_TYPE_NONE;
	int cart_size_bytes = 0;
	init();
	/* In/Out: PE{8..15} */
	config_gpio_data();
	/* In: PD{0..15} */
	config_gpio_addr();
	/* In: Other Cart Input Signals - PC{0..1} */
	config_gpio_sig();

	if (!(GPIOC->IDR & 0x0001))
		firmware_rom = firmware_pal60_rom;
	else if (!(GPIOC->IDR & 0x0002))
		firmware_rom = firmware_pal_rom;
	else
		firmware_rom = firmware_ntsc_rom;

	// set up status area
	strcpy(menu_status, "BY R.EDWARDS");
	menu_status[0xF] = 0;

	while (1) {
		int ret = emulate_firmware_cartridge();

		if (ret == CART_CMD_START_CART)
		{
			if (cart_type != CART_TYPE_NONE)
				emulate_cartridge(cart_type, cart_size_bytes);	// never returns
		}
		else if (ret == CART_CMD_ROOT_DIR)
		{
			curPath[0] = 0;
			if (!readDirectoryForAtari(curPath))
				strcpy(menu_status, "CANT READ SD");
		}
		else
		{
			int sel = ret - CART_CMD_SEL_ITEM_n;
			DIR_ENTRY *d = &dir_entries[sel];

			if (d->isDir)
			{	// selection is a directory
				if (!strcmp(d->filename, ".."))
				{	// go back
					int len = strlen(curPath);
					while (len && curPath[--len] != '/');
					curPath[len] = 0;
				}
				else
				{	// go into director
					strcat(curPath, "/");
					strcat(curPath, d->filename);
				}

				if (!readDirectoryForAtari(curPath))
					strcpy(menu_status, "CANT READ SD");
				Delayms(200);
			}
			else
			{	// selection is a rom file
				char path[256];
				strcpy(path, curPath);
				strcat(path, "/");
				strcat(path, d->filename);
				cart_type = read_file(path, &cart_size_bytes);
				Delayms(200);
				if (cart_type != CART_TYPE_NONE)
					menu_status[0xF] = 1;	// tell the atari cartridge is loaded
				else
					strcpy(menu_status, "BAD ROM FILE");
			}
		}
	}
}
